# ####################################################################

#  Created by Genus(TM) Synthesis Solution 21.18-s082_1 on Wed Mar 18 15:47:18 EDT 2026

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000fF
set_units -time 1000ps

# Set the current design
current_design scheduler_top

create_clock -name "clk" -period 10.0 -waveform {0.0 5.0} [get_ports clk]
set_clock_transition 0.1 [get_clocks clk]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_valid_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_valid_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_valid_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_valid_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[3][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[2][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[1][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_data_i[0][0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports out_ready_i]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports csr_write_i]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports csr_read_i]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_addr_i[0]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[31]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[30]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[29]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[28]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[27]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[26]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[25]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[24]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[23]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[22]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[21]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[20]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[19]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[18]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[17]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[16]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[15]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[14]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[13]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[12]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[11]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[10]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[9]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[8]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[7]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[6]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[5]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[4]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[3]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[2]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[1]}]
set_input_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_wdata_i[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_ready_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_ready_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_ready_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {in_ready_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports out_valid_o]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_data_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_src_idx_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {out_src_idx_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[31]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[30]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[29]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[28]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[27]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[26]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[25]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[24]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[23]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[22]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[21]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[20]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[19]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[18]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[17]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[16]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[15]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[14]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[13]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[12]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[11]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[10]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[9]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[8]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[7]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[6]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[5]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[4]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[3]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[2]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[1]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports {csr_rdata_o[0]}]
set_output_delay -clock [get_clocks clk] -add_delay -max 1.0 [get_ports csr_ready_o]
set_wire_load_mode "enclosed"
set_clock_uncertainty -setup 0.01 [get_clocks clk]
set_clock_uncertainty -hold 0.01 [get_clocks clk]
